{
  "chunk_id": "0e610fa8_002",
  "source_file": "amazon_kinesis_intro.md",
  "title": "What is Amazon Kinesis Data Streams?",
  "section": "What can I do with Kinesis Data Streams?",
  "content": "## What can I do with Kinesis Data Streams?\n\nYou can use Kinesis Data Streams for rapid and continuous data intake and aggregation. The type of\ndata used can include IT infrastructure log data, application logs, social media, market\ndata feeds, and web clickstream data. Because the response time for the data intake and\nprocessing is in real time, the processing is typically lightweight.\n\nThe following are typical scenarios for using Kinesis Data Streams:\n\n**Accelerated log and data feed intake and processing**\n:   You can have producers push data directly into a stream. For example, push\n    system and application logs and they are available for processing in\n    seconds. This prevents the log data from being lost if the front end or\n    application server fails. Kinesis Data Streams provides accelerated data feed intake\n    because you don't batch the data on the servers before you submit it for\n    intake.\n\n**Real-time metrics and reporting**\n:   You can use data collected into Kinesis Data Streams for simple data analysis and\n    reporting in real time. For example, your data-processing application can\n    work on metrics and reporting for system and application logs as the data is\n    streaming in, rather than wait to receive batches of data.\n\n**Real-time data analytics**\n:   This combines the power of parallel processing with the value of real-time\n    data. For example, process website clickstreams in real time, and then\n    analyze site usability engagement using multiple different Kinesis Data Streams\n    applications running in parallel.\n\n**Complex stream processing**\n:   You can create Directed Acyclic Graphs (DAGs) of Kinesis Data Streams applications and\n    data streams. This typically involves putting data from multiple Kinesis Data Streams\n    applications into another stream for downstream processing by a different\n    Kinesis Data Streams application.",
  "token_count": 375,
  "char_count": 1900,
  "chunk_index": 2,
  "total_chunks": 46,
  "overlap_with_previous": false,
  "metadata": {
    "service_name": "Amazon Kinesis",
    "document_type": "introduction",
    "header_level": 1,
    "file_size_chars": 9924,
    "processing_timestamp": "2025-08-02"
  }
}