{
  "source_file": "amazon_ec2_intro.md",
  "total_chunks": 6,
  "chunks": [
    {
      "chunk_id": "b9cee828_001",
      "source_file": "amazon_ec2_intro.md",
      "title": "What is Amazon EC2?",
      "section": "What is Amazon EC2?",
      "content": "# What is Amazon EC2?\n\nAmazon Elastic Compute Cloud (Amazon EC2) provides on-demand, scalable computing capacity in the Amazon Web\nServices (AWS) Cloud. Using Amazon EC2 reduces hardware costs so you can develop and deploy\napplications faster. You can use Amazon EC2 to launch as many or as few virtual servers as you\nneed, configure security and networking, and manage storage. You can add capacity (scale up)\nto handle compute-heavy tasks, such as monthly or yearly processes, or spikes in website\ntraffic. When usage decreases, you can reduce capacity (scale down) again.\n\nAn EC2 instance is a virtual server in the AWS Cloud. When you launch an EC2 instance,\nthe instance type that you specify determines the hardware available to your instance.\nEach instance type offers a different balance of compute, memory, network, and storage\nresources.",
      "token_count": 176,
      "char_count": 847,
      "chunk_index": 1,
      "total_chunks": 7,
      "overlap_with_previous": false,
      "metadata": {
        "service_name": "Amazon Ec2",
        "document_type": "introduction",
        "header_level": 1,
        "file_size_chars": 6316,
        "processing_timestamp": "2025-08-02"
      }
    },
    {
      "chunk_id": "b9cee828_002",
      "source_file": "amazon_ec2_intro.md",
      "title": "What is Amazon EC2?",
      "section": "Features of Amazon EC2",
      "content": "## Features of Amazon EC2\n\nAmazon EC2 provides the following high-level features:\n\n**Instances**\n:   Virtual servers.\n\n**Amazon Machine Images (AMIs)**\n:   Preconfigured templates for your instances that package the components you\n    need for your server (including the operating system and additional\n    software).\n\n**Instance types**\n:   Various configurations of CPU, memory, storage, networking capacity, and\n    graphics hardware for your instances.\n\n**Amazon EBS volumes**\n:   Persistent storage volumes for your data using Amazon Elastic Block Store (Amazon EBS).\n\n**Instance store volumes**\n:   Storage volumes for temporary data that is deleted when you stop,\n    hibernate, or terminate your instance.\n\n**Key pairs**\n:   Secure login information for your instances. AWS stores the public key\n    and you store the private key in a secure place.\n\n**Security groups**\n:   A virtual firewall that allows you to specify the protocols, ports, and\n    source IP ranges that can reach your instances, and the destination IP\n    ranges to which your instances can connect.\n\nAmazon EC2 supports the processing, storage, and transmission\nof credit card data by a merchant or service provider, and has been\nvalidated as being compliant with Payment Card Industry (PCI) Data Security Standard (DSS).",
      "token_count": 264,
      "char_count": 1299,
      "chunk_index": 2,
      "total_chunks": 7,
      "overlap_with_previous": false,
      "metadata": {
        "service_name": "Amazon Ec2",
        "document_type": "introduction",
        "header_level": 1,
        "file_size_chars": 6316,
        "processing_timestamp": "2025-08-02"
      }
    },
    {
      "chunk_id": "b9cee828_004",
      "source_file": "amazon_ec2_intro.md",
      "title": "What is Amazon EC2?",
      "section": "Services to use with Amazon EC2",
      "content": "### Services to use with Amazon EC2\n\nYou can use other AWS services with the instances that you deploy using Amazon EC2.\n\n**Amazon EC2 Auto Scaling**\n:   Helps ensure you have the correct number of Amazon EC2 instances available to\n    handle the load for your application.\n\n**AWS Backup**\n:   Automate backing up your Amazon EC2 instances and the Amazon EBS volumes attached to\n    them.\n\n**Amazon CloudWatch**\n:   Monitor your instances and Amazon EBS volumes.\n\n**Elastic Load Balancing**\n:   Automatically distribute incoming application traffic across multiple\n    instances.\n\n**Amazon GuardDuty**\n:   Detect potentially unauthorized or malicious use of your EC2 instances.\n\n**EC2 Image Builder**\n:   Automate the creation, management, and deployment of customized, secure, and\n    up-to-date server images.\n\n**AWS Launch Wizard**\n:   Size, configure, and deploy AWS resources for third-party applications\n    without having to manually identify and provision individual AWS\n    resources.\n\n**AWS Systems Manager**\n:   Perform operations at scale on EC2 instances with this secure end-to-end\n    management solution.",
      "token_count": 232,
      "char_count": 1120,
      "chunk_index": 4,
      "total_chunks": 7,
      "overlap_with_previous": false,
      "metadata": {
        "service_name": "Amazon Ec2",
        "document_type": "introduction",
        "header_level": 1,
        "file_size_chars": 6316,
        "processing_timestamp": "2025-08-02"
      }
    },
    {
      "chunk_id": "b9cee828_005",
      "source_file": "amazon_ec2_intro.md",
      "title": "What is Amazon EC2?",
      "section": "Additional compute services",
      "content": "### Additional compute services\n\nYou can launch instances using another AWS compute service instead of using Amazon EC2.\n\n**Amazon Lightsail**\n:   Build websites or web applications using Amazon Lightsail, a cloud platform\n    that provides the resources that you need to deploy your project quickly, for\n    a low, predictable monthly price.\n\n**Amazon Elastic Container Service (Amazon ECS)**\n:   Deploy, manage, and scale containerized applications on a cluster of EC2\n    instances.\n\n**Amazon Elastic Kubernetes Service (Amazon EKS)**\n:   Run your Kubernetes applications on AWS.",
      "token_count": 117,
      "char_count": 582,
      "chunk_index": 5,
      "total_chunks": 7,
      "overlap_with_previous": false,
      "metadata": {
        "service_name": "Amazon Ec2",
        "document_type": "introduction",
        "header_level": 1,
        "file_size_chars": 6316,
        "processing_timestamp": "2025-08-02"
      }
    },
    {
      "chunk_id": "b9cee828_006",
      "source_file": "amazon_ec2_intro.md",
      "title": "What is Amazon EC2?",
      "section": "Access Amazon EC2",
      "content": "## Access Amazon EC2\n\nYou can create and manage your Amazon EC2 instances using the following interfaces:\n\n**Amazon EC2 console**\n:   A simple web interface to create and manage Amazon EC2 instances and resources.\n    If you've signed up for an AWS account, you can access the Amazon EC2 console\n    by signing into the AWS Management Console and selecting **EC2** from\n    the console home page.\n\n**AWS Command Line Interface**\n:   Enables you to interact with AWS services using commands in your command-line shell. It\n    is supported on Windows, Mac, and Linux.\n\n**AWS CloudFormation**\n:   Amazon EC2 supports creating resources using AWS CloudFormation. You create a template, in JSON or YAML\n    format, that describes your AWS resources, and AWS CloudFormation provisions and\n    configures those resources for you.\n\n**AWS SDKs**\n:   If you prefer to build applications using language-specific APIs instead\n    of submitting a request over HTTP or HTTPS, AWS provides libraries, sample\n    code, tutorials, and other resources for software developers.\n\n**AWS Tools for PowerShell**\n:   A set of PowerShell modules that are built on the functionality exposed by\n    the SDK for .NET. The Tools for PowerShell enable you to script operations on your AWS\n    resources from the PowerShell command line.\n\n**Query API**\n:   Amazon EC2 provides a Query API. These requests are HTTP or HTTPS requests that\n    use the HTTP verbs GET or POST and a Query parameter named\n    `Action`.",
      "token_count": 312,
      "char_count": 1482,
      "chunk_index": 6,
      "total_chunks": 7,
      "overlap_with_previous": false,
      "metadata": {
        "service_name": "Amazon Ec2",
        "document_type": "introduction",
        "header_level": 1,
        "file_size_chars": 6316,
        "processing_timestamp": "2025-08-02"
      }
    },
    {
      "chunk_id": "b9cee828_007",
      "source_file": "amazon_ec2_intro.md",
      "title": "What is Amazon EC2?",
      "section": "Pricing for Amazon EC2",
      "content": "## Pricing for Amazon EC2\n\nAmazon EC2 provides the following pricing options:\n\n**Free Tier**\n:   You can get started with Amazon EC2 for free. To explore the Free Tier options,\n    see AWS Free Tier.\n\n**On-Demand Instances**\n:   Pay for compute capacity by the hour or second with no long-term commitments.\n\n**Reserved Instances**\n:   Make a low, one-time payment and receive a significant discount on the hourly charge for that instance.\n\n**Spot Instances**\n:   Request unused EC2 instances, which can lower your Amazon EC2 costs significantly.\n\n**Dedicated Hosts**\n:   Pay for a physical host that is fully dedicated to running your instances, and bring your existing per-socket, per-core, or per-VM software licenses to reduce costs.\n\n**Dedicated Instances**\n:   Pay, by the hour, for instances that run on single-tenant hardware.\n\n**Capacity Reservations**\n:   Reserve capacity for your EC2 instances in a specific Availability Zone for any duration.",
      "token_count": 208,
      "char_count": 954,
      "chunk_index": 7,
      "total_chunks": 7,
      "overlap_with_previous": false,
      "metadata": {
        "service_name": "Amazon Ec2",
        "document_type": "introduction",
        "header_level": 1,
        "file_size_chars": 6316,
        "processing_timestamp": "2025-08-02"
      }
    }
  ]
}